Show / Hide Table of Contents
Class LoadGroupSIA
Load group for SIA
Inheritance
System.Object
OpenObject
OpenElementId
LoadGroup
LoadGroupSIA
Inherited Members
 LoadGroup.Name
 LoadGroup.Relation
 LoadGroup.GroupType
 LoadGroup.GammaQ
 LoadGroup.Dzeta
 LoadGroup.GammaGInf
 LoadGroup.GammaGSup
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.LoadGroupSIA,CI.Loading", "CI.StructModel.Loading.ILoadGroup,CI.BasicTypes", typeof(LoadGroup))]
public class LoadGroupSIA : LoadGroup
Constructors
Improve this Doc   View Source
LoadGroupSIA()
Constructor
Declaration
public LoadGroupSIA()
Properties
Improve this Doc   View Source
Psi0
ψ 0
Declaration
public double Psi0 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Psi1
ψ 1
Declaration
public double Psi1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Psi2
ψ 2
Declaration
public double Psi2 { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source